{"slug":"2020-year-in-review","title":"Looking Back at 2020","date":"2020-12-28T00:00:00.000Z","excerpt":"2020 definitely wasn't our best year... but let's remember what was good about it.","tags":["Meta"],"html":"<p>We all know this year hasn’t been easy. That doesn’t mean it had to be wasted. Regardless of how bad or good it has been for oneself individually, there are always lots of lessons we can learn from what we’ve been through.</p>\n<h2>More Than One Pandemic</h2>\n<p>I think one of the most obvious takeaways from this year is that we are not living just one pandemic (COVID-19), but also one that’s equally worrisome and potentially even deadlier: misinformation. The sheer amount of false information and hatred being spread through both social media and real life is becoming bigger every passing day.</p>\n<p>They can be shared by ignorance, personal or political interest, or simply to “watch the world burn”. It is painful to watch the world go backwards like this; especially when people close to you are affected as well. </p>\n<h2>Mental Health</h2>\n<p>I am sure that regardless of any individual impact the pandemics have had, your mental health must have been impacted by all of this somehow. “Doomscrolling” became a thing, fueled by our time watching and reading terrible news while quarantining in the safety of our homes.</p>\n<p>Initially, I was guilty of that too. Checking many times a day for news, how the pandemic was growing, getting angry at how our leaders were dealing with it, and more. Fortunately, I ended up realizing how harmful that was to my mental health, and that there was no good coming out of it. <span class=\"wrapper svelte-1sgfl7c\">A few minutes a day is enough to catch up on important news, the rest of the day can be spent on myself.</span> So instead of mindlessly scrolling through the doom and gloom on the internet, I started to work on more personal projects, learning new stuff, and playing games.</p>\n<h2>Learning with Personal Projects</h2>\n<p>This year I worked on a few personal projects, and tried different approaches with them so I could learn new things. I didn’t necessarily get really in-depth into most of the things I learned, but the knowledge I got definitely made me a better developer.</p>\n<picture class=\"svelte-1gy5t1o\"><source srcset=\"/optimized-images/posts/2020-year-in-review/pocket-companion.avif\" type=\"image/avif\">\n\t<source srcset=\"/optimized-images/posts/2020-year-in-review/pocket-companion.webp\" type=\"image/webp\">\n\t<img src=\"/optimized-images/posts/2020-year-in-review/pocket-companion.png\" alt=\"Screenshot of my Pocket Companion app\" loading=\"lazy\" decoding=\"async\" class=\"svelte-1gy5t1o\">\n  \n</picture>\n<ul><li><a href=\"/ionic-animal-crossing-companion/\">I built an Animal Crossing companion app</a>, with great utilities for when playing the game. I focused a lot on CSS animations for this one, while trying to mimic the official Nintendo app in looks. Learned a lot of things while building it:<ul><li>State management in Angular projects, with <a href=\"https://ngrx.io/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">NgRx</a>;</li>\n<li>Offline functionality with IndexedDB in the browser;</li>\n<li>Improved CSS Animations;</li>\n<li>Improved Ionic and PWA knowledge;</li>\n<li>Improved performance knowledge, with Web Workers, Virtual Scrolling and Lazy Loading;</li></ul></li>\n<li>I redesigned part of my website - I decided to change things up a bit, with an animated (but still lightweight) header background, a new logo, typography improvements, code highlighting, and more. I think it looks more professional than before, and represents my way of building things better as well;</li>\n<li>I built <a href=\"https://github.com/matfantinel/resume\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">my Resume as a Web Component</a> - using StencilJS to build it, and CSS Grid for the layout. Both of those things were new to me, so it was pretty interesting;</li>\n<li>I learned about <a href=\"/css-scroll-snapping/\">CSS Scroll Snapping</a> - a fantastic new CSS capability that helps with reducing the amount of JS in our websites;</li>\n<li>I focused a lot on improving my design skills this year. While I’m still a developer (and plan on continuing to be), designing things is something I find very fun. I learned messing with a few design-related things this year:<ul><li>Edit SVG files in Inkscape - still a lot to learn, but I’m already capable of doing some edits to existing files;</li>\n<li>Build high-fidelity mockups in Figma - being able to design more quickly than I was by building it was great for speeding up the process, and being able to collect feedback earlier was fantastic as well;</li></ul></li>\n<li>I started to contribute a bit more to Open Source projects, like <a href=\"https://elementary.io\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">elementary OS</a>. Mainly with a still-in-progress website rebuild, but also with tons of feedback, issue reports, offering support and participating on discussions.</li></ul>\n<h2>Fun</h2>\n<p>Since I committed myself to stop seeing bad things and focus on good ones, I resorted to at-home entertainment a lot this year. My highlights:</p>\n<h3>TV and Movies</h3>\n<ul><li><p><strong>Mr. Robot</strong> was a jaw-dropping series. I started watching it just this year, and binged to the finale quickly. It was an incredibly powerful series, with genius writing and cinematography. Highly recommend it to anyone, even if not a fan of the tech/hacking theme;</p></li>\n<li><p><strong>Community</strong> was a great find; It’s not a series I had ever heard of when it was still airing, as it never got popular here in Brazil. However, after hearing about it on the web and finding it on Netflix, I’m so glad I started watching it. Loads of fun, full of references, internal jokes and Dan Harmon genius;</p></li></ul>\n<h3>Games</h3>\n<ul><li><p><strong>Animal Crossing New Horizons</strong> was one of the best things to happen this year. It’s far from a perfect game, but it could not have been better for the current situation, providing an easy escape into a world free of our current burdens. It came out at the beginning of quarantine and still provides daily wholesomeness to this day;</p></li>\n<li><p><strong>Dungeons &amp; Dragons</strong> was a surprising source of fun considering my party only played online this year. But even with social distancing, we managed to have a lot of fun. With <a href=\"https://foundryvtt.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">FoundryVTT</a>, things are much easier to handle and it’s not much harder to get immersed. I’m even trying to be a DM of my own campaign… I’m not sure it’s going as well as I hoped, but hey, at least I’m trying.</p></li>\n<li><p><strong>Hollow Knight</strong>… I’m so glad I played it. Being a Metroidvania, a genre I’m not really a fan of, it completely hooked me with its worldbuilding, art style, atmosphere and frustratingly satisfying difficulty. A 10/10 for me, for sure;</p></li></ul>\n<picture class=\"svelte-1gy5t1o\"><source srcset=\"/optimized-images/posts/2020-year-in-review/hollow-knight.avif\" type=\"image/avif\">\n\t<source srcset=\"/optimized-images/posts/2020-year-in-review/hollow-knight.webp\" type=\"image/webp\">\n\t<img src=\"/optimized-images/posts/2020-year-in-review/hollow-knight.png\" alt=\"Hollow Knight official artwork\" loading=\"lazy\" decoding=\"async\" class=\"svelte-1gy5t1o\">\n  <figcaption><!-- HTML_TAG_START -->Hollow Knight official artwork, by Team Cherry<!-- HTML_TAG_END --></figcaption>\n</picture>\n<h2>Writing</h2>\n<p>Well, since this is only the third blog post this year, I definitely did not do much writing. I haven’t felt inspired to do so, as I was often busy building nice things or winding down from all the mess that was going on. I’ll repeat my intention of trying to write more next year, of course, since it shouldn’t be hard to do at least more than in 2020.</p>\n<h2>Wrapping Up</h2>\n<p>If you’re still reading, thanks! You’re probably my mom or fiancée. Anyway, 2020 was a very exciting year, even if not in a good way. Let’s hope 2021 is a more boring one. See you then!</p>","css":{"code":".wrapper.svelte-1sgfl7c{background:var(--highlight-marker-url)}\npicture.svelte-1gy5t1o.svelte-1gy5t1o{position:relative;width:100%;height:100%}picture.svelte-1gy5t1o img.svelte-1gy5t1o{width:100%;height:100%}","map":null},"head":"","readingTime":"6 min read","relatedPosts":[{"slug":"2021-year-in-review","title":"2021 In Review","date":"2021-12-09T00:00:00.000Z","excerpt":"Another year, another yearly review post. 2021 felt like pretty much 2020 part II for a lot of people, me included.","tags":["Meta"],"html":"<p>Another year, another yearly review post. 2021 felt like pretty much 2020 part II for a lot of people, me included. The ongoing pandemic still affected our lives, and even though most people in my country are now vaccinated (including me), the danger still exists and preventive measures are still necessary. But it’s nice to be able to start doing things and going places we haven’t been able to for a while. I personally think this situation is still going to drag on for a while, but we’ll adapt to it with time.</p>\n<h2>Mental Health</h2>\n<p><a href=\"/2020-year-in-review\">Last year</a>, I wrote a bit about doomscrolling, and how it started affecting me until I decided to avoid this behavior. I tried to keep avoiding it this year, and I think I succeeded. I’m not blind to what’s going on - I still know <div class=\"sparkle-wrapper svelte-exdx8u\">\n\t<div class=\"slot-wrapper svelte-exdx8u\"><strong class=\"text-secondary\">the world is a dumpster fire</strong></div>\n</div> at the moment and in many ways it was even worse than 2020 - but I think I was successful in not dwelling on the bad news and the daily absurdities going on.</p>\n<p>That doesn’t mean my mental health didn’t take a hit though. The year started with the loss of a person I held dear - a victim of the inexcusable vaccination delays and genocidal actions of our leaders - and I felt like I lost a bit of control over my work-life-balance for a portion of the year.</p>\n<p>This year I also started therapy though, which I feel is a good way to deal with the growing anxiety from the past few years. I’ve been able to know more about myself and how my brain works, so I can focus on what I found out to improve my life, one day at a time.</p>\n<h2>Work Life</h2>\n<p>Early this year I changed jobs, and started working as a contractor. This has given me more freedom to make my own hours and allowed me to work with a more diverse set of people. It took me a while to use this freedom the right way, though. For a few months I felt like my work-life balance was off, and I felt like my energy was being drained fast. Luckily I was able to notice the early signs of a burnout and took a step back to avoid it. I am now working on my 2nd project as a contractor and I feel that getting the work hours under control allowed me to do my work better, since my mind gets the time to rest.</p>\n<h2>Learning and Comparing</h2>\n<p>Most of the learning I did this year was on my day job, and not personal projects. Last year, I worked a lot with Angular and Vue 2. This year, I worked with Vue 3, React and PHP (😩), and on my personal time I started to practice my Svelte skills. That’s a lot of frameworks!</p>\n<p>Although every project is different, working with components makes you solve similar problems all the time. And after having worked with basically all mainstream frameworks for a bit, I feel like I can see pros and cons to each of them:</p>\n<h3>Angular</h3>\n<ul><li><p><strong>Pros:</strong> it’s very opinionated, which means there are always recommended ways of doing something. This makes the code consistent, and using TypeScript by default makes it much easier to maintain big projects. I like the template syntax and the separation between HTML, CSS and TS. I also can definitely see why it’s a choice in many enterprise environments: the majority of Angular projects I’ve seen have similar structure, which makes devs productive really quickly after being hired.</p></li>\n<li><p><strong>Cons:</strong> it’s very opinionated, which means it’s not as flexible as other options. The focus on clear separation of concerns and TypeScript can also be a burden for smaller apps. Sometimes you want to make a quick prototype or just build something simpler, and it’s easy to find Angular overkill.</p></li></ul>\n<h3>Vue</h3>\n<ul><li><p><strong>Pros:</strong> I really like the premise of Vue being “incrementally adoptable”. This makes Vue really simple on the surface and hides many of its complexities. The template syntax is similar to Angular and it’s easy to keep concerns separated if you want to.</p></li>\n<li><p><strong>Cons:</strong> In my personal experience I felt like the Composition API, introduced in Vue 3, goes against my favorite things in Vue previously. Instead of being an extension to HTML/JS, it makes you completely rethink how to build the components, and I feel like it makes things more complicated than they should be. Also, the ecosystem around it (plugins, components, etc) took a big hit with the transition from v2 to v3, because it had many breaking changes.</p></li></ul>\n<h3>React</h3>\n<p>My experience with React has not been as extensive as the other ones here, so I think I’m still not past the point of “initial impressions”. Still, here are my thoughts:</p>\n<ul><li><p><strong>Pros:</strong> Super flexible, and with a ginormous ecosystem to back it up. You can write a React app in so many ways and there’s always an open-source plugin or component for what you want to do. The existence of NextJS makes using React a better experience.</p></li>\n<li><p><strong>Cons:</strong> Ok, I really don’t like JSX. I usually like to keep concerns separated and using JS to build the HTML like this is not my cup of tea. I find it hard to understand at a glance, and feel like it overrides the default web stack too much. Unlike the other frameworks, when I use React I feel like I’m developing a React app instead of a web app. Also, in contrast to Angular, the flexibility of React makes it so that React projects can be so different from one another you’d have a difficult time adapting, even though they use the same framework (this is mitigated by meta-frameworks like NextJS, which are very opinionated, thankfully).</p></li></ul>\n<h3>Svelte</h3>\n<p>I have a clear favorite here, but I feel that Svelte hits the sweet spot in many ways.</p>\n<ul><li><p><strong>Pros:</strong> I like the template syntax (not as clean as Vue’s or Angular’s, but similar enough), the clear separation of concerns, and how it likes to stay out of your way. Most of all though, I love how Svelte makes me just feel like I’m building a “vanilla” web page, but with added goodies. <span class=\"wrapper svelte-1sgfl7c\">It extends the web instead of replacing it.</span></p></li>\n<li><p>The fact that it is a compiler frees it from the need for a Virtual DOM, which then makes the code you need to write much simpler. No need for <em>useState</em>, <em>useEffect</em>, or keeping track of two-way binding to maintain state between components - you just have to set the variables and Svelte does the rest. I just think about my logic, not about how the framework works.</p></li>\n<li><p>Its official meta-framework, SvelteKit, also has great defaults. It works by using native HTML tags instead of trying to emulate them. Instead of a <code>&lt;Link&gt;</code>, just use <code>&lt;a&gt;</code>. Instead of using JS to post data, just use a <code>&lt;form&gt;</code>. This makes the app leaner, more accessible, and work with JS disabled by default.</p></li>\n<li><p><strong>Cons:</strong> Svelte is relatively new, and therefore its ecosystem is still lacking. I’ve had trouble properly integrating a SvelteKit project with Storybook or Jest, for example, since Kit is still in Beta. There are also many components that don’t have a Svelte version yet, and while some of them have a “Vanilla JS” option that usually works, it’s still not as seamless as it could be.</p></li></ul>\n<h2>Personal Projects</h2>\n<p>I didn’t work on many personal projects this year, as I was already learning a lot on my day job. I did, however, <span class=\"wrapper svelte-1sgfl7c\">completely rewrite my website!</span></p>\n<p>I really liked the previous one, but I wanted to change some things about it and use something more flexible than Jekyll. So I completely redesigned it using Figma - while retaining some design elements from before - and rewrote it with SvelteKit. <a href=\"https://fantinel.dev/blog-development-sveltekit/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">I wrote a blog post talking more about the experience</a>, which also became my most-read post of all time. Nice!</p>\n<p>Speaking of blog posts, <div class=\"sparkle-wrapper svelte-exdx8u\">\n\t<div class=\"slot-wrapper svelte-exdx8u\"><strong class=\"text-secondary\">I doubled the amount of posts published compared to last year!</strong></div>\n</div> Which means I wrote… <strong>4</strong> (excluding this one). I wanted to write more, but compared to the 2 posts from last year, it’s still an improvement, <em>right</em>?</p>\n<h2>Fun</h2>\n<p>Not everything is code and gloom - I also do some fun things every once in a while.</p>\n<h3>TV and Movies</h3>\n<ul><li><p><strong>Ted Lasso</strong> is the TV equivalent of a hug. I’ve never seen a show that can balance comedy, wholesomeness and an enthralling story and characters so well. It touches on delicate subjects in a way that still makes you feel good, and yet is capable of sending the intended message. Honestly can’t find anything I dislike about it.</p></li>\n<li><p><strong>Better Call Saul</strong> was surprisingly good. I initially dismissed it as being just a spin-off of a popular show, but it slowly evolved into a tightly-woven drama that keeps me at the edge of my seat. The stakes are lower here than they are in Breaking Bad, but I feel like I care more about the characters on this one.</p></li></ul>\n<h3>Games</h3>\n<ul><li><p><strong>The Last of Us</strong> was surprisingly surprising for me. I am 8 years late to the party here, but I didn’t have a PlayStation since the PS1, and not only I hadn’t played this game, I never felt like doing so. I usually favor creative gameplay instead of a complex story, but finally gave it a go this year. Wow. It was an amazing experience from start to finish, though I admit it felt more like a more immersive movie than a game. That being said, I don’t think any movie can match the immersion that a game with a good story can provide.</p></li>\n<li><p><strong>No Man’s Sky</strong> is a mix of exploration and existential crisis. There are a lot of things to do (though not all of them have much depth), but the main gameplay loop of exploring planets and seamlessly traversing between them is addictive. Plus, the main story was surprisingly good, with a lot of amazing quotes from the Travellers in that universe. A bit of existential crisis was the icing on the cake.</p></li></ul>\n<picture class=\"svelte-1gy5t1o\"><source srcset=\"/optimized-images/posts/2021-year-in-review/no-mans-sky.avif\" type=\"image/avif\">\n\t<source srcset=\"/optimized-images/posts/2021-year-in-review/no-mans-sky.webp\" type=\"image/webp\">\n\t<img src=\"/optimized-images/posts/2021-year-in-review/no-mans-sky.png\" alt=\"Screenshot of a character in No Man&#39;s Sky saying: &#39;Existence is beautiful, if you let it be. Life is not a question. There does not need to be an answer.&#39;\" loading=\"lazy\" decoding=\"async\" class=\"svelte-1gy5t1o\">\n  \n</picture>\n<ul><li><p><strong>Metroid Dread</strong> was a lot of fun! I never liked games of this genre (Metroidvania) until I played Hollow Knight, last year. I felt like finally giving Metroid a chance since it was the first main entry in 19 years and the reviews were stellar. I was not disappointed. I feel like it doesn’t match Hollow Knight in its worldbuilding and ambientation, but the gameplay in Metroid Dread felt much more fluid, making almost everything in it a joy.</p></li>\n<li><p><strong>Dungeons &amp; Dragons</strong> has continued to be one of the highlights of my weeks. My party still played online this year, but it was a lot of fun. We finally finished the Curse of Strahd campaign after 502 days. The finale was so epic we decided to have it illustrated by the amazing <a href=\"https://www.gholz.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Guilherme Holz</a>.</p></li></ul>\n<picture class=\"svelte-1gy5t1o\"><source srcset=\"/optimized-images/posts/2021-year-in-review/dnd.avif\" type=\"image/avif\">\n\t<source srcset=\"/optimized-images/posts/2021-year-in-review/dnd.webp\" type=\"image/webp\">\n\t<img src=\"/optimized-images/posts/2021-year-in-review/dnd.png\" alt=\"Illustration of a Dungeons and Dragons party dealing the killing blow to the vampire Strahd\" loading=\"lazy\" decoding=\"async\" class=\"svelte-1gy5t1o\">\n  <figcaption><!-- HTML_TAG_START -->It was kind of poetic to have a bolt of holy light (in the form of a spear) be the end of one who brought so much darkness to the land. From left to right: Ylanis, Alesteir (me), Aliana and Garreth. The guy getting stabbed is Strahd, the big bad evil guy.<!-- HTML_TAG_END --></figcaption>\n</picture>\n<h2>What to Expect in 2022</h2>\n<p>First of all, <div class=\"sparkle-wrapper svelte-exdx8u\">\n\t<div class=\"slot-wrapper svelte-exdx8u\"><strong class=\"text-secondary\">I’m getting married! 💍</strong></div>\n</div> The love of my life and I are finally making it official. </p>\n<p>Later in the year I’m also temporarily moving to Italy for a few months with my (soon-to-be) wife. It’s going to be some sort of test drive - we’ll return to Brazil before the year ends and then decide if living abroad is something we want or not.</p>\n<p>As for this blog, I hope to again write more than I did this year. I have a few ideas in the oven, but have been struggling to write them down. Hopefully the big life changes are the inspiration I need.</p>\n<p>I also have some ideas for some personal projects that may or may not see the light of day. Let’s see how it goes.</p>\n<h2>Wrapping Up</h2>\n<p>2021 was overall a weird year, but I feel 2022 is going to have more going on. I wish you happy holidays and that you have a memorable 2022. See you then!</p>","css":{"code":".sparkle-wrapper.svelte-exdx8u.svelte-exdx8u{position:relative;display:inline-block}.sparkle-wrapper.svelte-exdx8u .slot-wrapper.svelte-exdx8u{position:relative;z-index:1}\n.wrapper.svelte-1sgfl7c{background:var(--highlight-marker-url)}\npicture.svelte-1gy5t1o.svelte-1gy5t1o{position:relative;width:100%;height:100%}picture.svelte-1gy5t1o img.svelte-1gy5t1o{width:100%;height:100%}","map":null},"head":"","readingTime":"11 min read"},{"slug":"2019-year-in-review","title":"Cool things I did and learned in 2019","date":"2019-12-29T00:00:00.000Z","excerpt":"A quick look back at 2019 and what I learned during this year.","tags":["Meta","Open Source"],"html":"<p>Another year went by - Year 6 of my software development journey! I wanted to write this blog post to sum up stuff that I’ve done or learned this year. Keep in mind this is being written off the top of my head - I did not keep a journal throughout the year, but hopefully that’s something I’ll do in 2020.</p>\n<h2>Complexity is your enemy</h2>\n<p>As programmers, we are puzzle-solvers. We like to think outside the box, applying different concepts, putting all of those nice things we’ve learned everywhere. This… often backfires. Most of the time what works best are the simplest solutions, which are also easier to maintain in the future by you or others. I’ve seen this quote somewhere a while back: “Programmers spend the first years of their careers mastering complexity only to realize they should master simplicity instead”. I guess I’m not in my first years anymore?</p>\n<p>I’ve changed my process in writing code to this:</p>\n<ol><li>Understand the problem/goal;</li>\n<li>Draw a simple mental picture of how to solve it (really simplify it);</li>\n<li>Code in small steps and test them as you go;</li>\n<li>Make it work. Code can look quite ugly in this step;</li>\n<li>Optimize it, performance-wise;</li>\n<li>⭐️ Try to explain how it works to yourself (mentally or by text), and then refactor the code to be as simple as possible;</li></ol>\n<p>This last step might make the initial release take a little longer, but oh boy does it pay off whenever you or someone else has to maintain it.</p>\n<h2>Vanilla JS is the best</h2>\n<p>Wait, I’m not saying you shouldn’t use any framework. If it helps you do your work better, go ahead! But “Vanilla” JS has come such a long way and there are so many amazing APIs coming out that using it solely is a valid option again. But more than that, those APIs are built in a way that popular frameworks can use them and communicate with each other with little effort. I’ve covered a bit of this on <a href=\"/microfrontends/\">my Microfrontends post</a>, but there are more APIs that I’ve discovered this year that are pretty awesome:</p>\n<ul><li><a href=\"/microfrontends/\">Web Components/Shadow DOM/Custom Elements</a>;</li>\n<li><a href=\"/web-workers/\">Web Workers</a>;</li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Intersection_Observer_API\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">IntersectionObserver</a>;</li>\n<li>Not exactly new, but <a href=\"/what-are-pwas-and-why-should-i-care-about-them/\">PWAs</a> are increasingly awesome;</li></ul>\n<h2>Jekyll</h2>\n<p>I’m a bit late to the party, but this is still something I’ve found out about in 2019. This website/blog you’re seeing is built on top of Jekyll, a tool for making static websites.</p>\n<p>Basically, you have HTML, CSS and JS. Add some special powers for using variables/loops inside that HTML code and ta-da! It works. Jekyll also allows you to create pages from Markdown (.md) files. I use it for blog posts like this one.</p>\n<p>Since it’s a static website, it means the code that’s served to users/visitors is compiled just once and then served as HTML files. No servers or APIs necessary. It’s pretty cool. You can check more about Jekyll <a href=\"https://jekyllrb.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">here</a> and can check the source code for my website <a href=\"https://github.com/matfantinel/matfantinel.github.io\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">here</a>.</p>\n<h2>Open Source is awesome</h2>\n<p>I have released two open-source apps this year for elementaryOS (<a href=\"https://github.com/matfantinel/reminduck\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Reminduck</a> and <a href=\"https://github.com/matfantinel/moneta\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Moneta</a>). I gotta say, besides the fact that I was learning an entirely different development stack (Vala, GTK, Desktop native), the best “new” thing I enjoyed was doing it in the open.</p>\n<p>These are not complex, commercial apps or anything like that. They’re small utilities that I use on a daily basis and that were made open and released in hopes of helping anyone out there too. And I gotta say, having users like your software is great, but having them actively contribute to it is even better. As soon as they were released/made public, I started receiving pull requests, bug reports, feature requests, and translations from everywhere. <strong>It’s so amazing that people from all over the world took interest in my little idea and helped improve them any way they could.</strong></p>\n<p>But open source is not just other people contributing to your projects, it’s also the opposite! I can improve other people’s apps that I use, I can report bugs openly and help out, or just download the source code, change a few things just to fit my workflow better and run it. And not only apps, I can do that with the entire OS I run on my PC! Not to mention having access to other people’s code allows you to learn from their work and saves you tons of time. Having a problem on your app and you know one that has solved that? Just check out what they did. Copy it, modify it, learn it, ship it. It’s all good.  <span class=\"wrapper svelte-1sgfl7c\">We wouldn’t have to spend so much time reinventing wheels if more of our code was open.</span></p>\n<p>Ah, this website is also open source. I used others as inspiration and took some code snippets too! So can you, feel free to fork it and modify anyway you want.</p>\n<h2>Working remotely is fun, at least for some people</h2>\n<p>In August I started working remotely for the first time. I work from my home in Brazil with people from US, Europe and India. It was definitely refreshing to not have to commute and always be at a place that makes you feel good. Not only that, but the flexible hours allow me to work whenever I want and I can enjoy things that weren’t possible on a regular “9 to 5” routine.</p>\n<p>Although… I end up working the same hours as I did before. It feels “right” to work at this time, and I can enjoy my family at night, since they also work during the day. But it’s nice to have the flexibility to have a break and a coffee somewhere else during the day if needed.</p>\n<p>One of the main things people say about working from home is that sometimes it’s hard to separate work time from free time. Fortunately, I didn’t have that issue. My apartment is quite small, so I don’t have a proper office and instead work on a desk on my bedroom, which means the temptation of lying down and sleeping is always beside me. I’m so thankful I am able to resist that and get work done. And after work hours I can fully disconnect from it and not be stressed out, even if I stay on the computer. I totally understand why some people would not enjoy this and would be less productive, fortunately I was not the case.</p>\n<p>The one thing I’d say is worse in my case is communication. I’m not an extremely social person - therefore I don’t miss chitchat during the day with colleagues or anything like that. It’s just that it’s harder to explain code and concepts over a call or screen share. Not everyone is always readily available to explain things because of different timezones, so you have to figure more things out on your own. It’s still doable though, and the days of “just coding” without interruptions are a dream. The pros outweight the cons.</p>\n<h2>There’s never enough time</h2>\n<p>This year, I started getting into writing more open source software and started working from home. The latter means I can work more on house chores since there’s no commute and I’m always around! Still, there’s never enough time for me to do what I want to do. I took time to write some elementaryOS apps, but I want to do some web apps too, and code some more, and play some games, watch series, movies, hang out with family, work, write on this blog, oof. This isn’t a new discovery by any means, but I feel like it’s getting worse every year. This is adult life, I guess.</p>\n<h2>Wrapping up</h2>\n<p>Anyway, 2019 was a good year. I (of course) hope to do more and better in 2020, hopefully including more articles here. Hope you all have some nice holidays and a great new year!</p>","css":{"code":".wrapper.svelte-1sgfl7c{background:var(--highlight-marker-url)}","map":null},"head":"","readingTime":"7 min read"},{"slug":"purpose-of-this-blog","title":"The purpose of this blog","date":"2019-03-08T00:00:00.000Z","excerpt":"Why does it exist?","tags":["Meta"],"html":"<p>There are many developer blogs out there, probably because developers like to ramble about the tech they enjoy. I’m guilty of that too! This blog was created mainly for that - sharing about development stuff that I like or that I’m learning. </p>\n<p>The purpose is to help myself learn about the subjects better, since there’s no better way to learn than trying to reach someone. Of course, it won’t be made of tutorials only - I intend to write about some theoretical concepts, and maybe tech stuff not related to development.</p>\n<p>I consider myself a tech enthusiast. Which means I like to talk about software and gadgets in a way that most other people would find me annoying. This can be a great place to be able to share this with people that may care, hopefully you!</p>\n<p>I hope to see you here in future posts, and I hope you enjoy reading what I have to say!</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}